app/controllers/cat_requests_controller.rb

  def index
    @rental = CatRentalRequest.all
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"

  def create
    @rental = CatRentalRequest.new(rental_params)

    if @rental.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["created_at", Tue, 30 Sep 2014 23:22:28 UTC +00:00], ["end_date", Fri, 19 Sep 2014], ["start_date", Mon, 08 Sep 2014], ["updated_at", Tue, 30 Sep 2014 23:22:28 UTC +00:00]]

  def approve
    CatRentalRequest.find(params[:cat_request_id]).approve!
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", "1"]]

  def deny
    CatRentalRequest.find(params[:cat_request_id]).deny!
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", "1"]]