app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = 7  [["birth_date", Tue, 01 Jul 2014], ["color", "brown"], ["name", "qwer"], ["sex", "F"], ["description", "qwer"], ["updated_at", Tue, 30 Sep 2014 19:53:24 UTC +00:00]]